package de.telran.homework5;

import java.util.Random;

public class Homework2 {
    public static void main(String[] args) {

        // 1.
        // -> Есть устройство, на табло которого показывается количество секунд,
        // оставшихся до конца рабочего дня.
        // -> Когда рабочий день начинается ровно в 9 часов утра — табло отображает «28800» (т.е. остаётся 8 часов),
        // -> когда 14:30 — на табло «9000» (т.е. остаётся два с половиной часа),
        // а когда наступает 17 часов — на табло отображается «0» (т.е. рабочий день закончился).
        // -> Некоторый сотрудники не умеют оценивать остаток рабочего дня в секундах.
        // -> Требуется написать программу, которая вместо секунд будет выводить на табло понятные
        // фразы с информацией о том, сколько полных часов осталось до конца рабочего дня.
        // -> Например: «осталось 7 часов», «осталось 4 часа», «остался 1 час», «осталось менее часа».
        // -> Объяснение: в переменную n должно записываться случайное (на время тестирования программы)
        // целое число из диапазона от 0 до 28800, далее оно должно выводиться на экран
        // (для тех, кто понимает в секундах) и на следующей строке (для тех кто не понимает)
        // должна выводиться фраза о количестве полных часов, содержащихся в n секундах.


        // Генерация случайного числа в диапазоне от 0 до 28800 (количество секунд в рабочем дне)
        Random random = new Random();
        int n = random.nextInt(28801);

        // Вывод информации для тех, кто понимает в секундах
        System.out.println("Осталось секунд: " + n);

        // Вывод информации для тех, кто не понимает в секундах
        displayRemainingHours(n);
    }

    // Метод для вывода фразы о количестве полных часов
    public static void displayRemainingHours(int seconds) {
        int remainingHours = seconds / 3600; // 1 час = 3600 секунд

        if (remainingHours > 1) {
            System.out.println("Осталось " + remainingHours + " часов");
        } else if (remainingHours == 1) {
            System.out.println("Остался 1 час");
        } else {
            System.out.println("Осталось менее часа");
        }
    }
}
